bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
// Copyright 2022-2023 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once

#include "sdkconfig.h"

#ifdef __cplusplus
extern "C" {
#endif

#define SYS_DEVICE_ID_ADDR (SOC_SYSTEM_REG_BASE + (0x0 << 2))

#define SYS_DEVICE_ID_DEVICEID_POS (0)
#define SYS_DEVICE_ID_DEVICEID_MASK (0xffffffff)

#define SYS_VERSION_ID_ADDR (SOC_SYSTEM_REG_BASE + (0x1 << 2))

#define SYS_VERSION_ID_VERSIONID_POS (0)
#define SYS_VERSION_ID_VERSIONID_MASK (0xffffffff)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_ADDR (SOC_SYSTEM_REG_BASE + (0x2 << 2))

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_BOOT_MODE_POS (0)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_BOOT_MODE_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_1_1_POS (1)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_1_1_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED0_POS (2)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED0_MASK (0x3)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RF_SWITCH_MANUAL_EN_POS (4)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RF_SWITCH_MANUAL_EN_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RF_SOURCE_POS (5)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RF_SOURCE_MASK (0x3)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED1_POS (7)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED1_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_8_8_POS (8)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED_BIT_8_8_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FLASH_SEL_POS (9)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FLASH_SEL_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FEM_BPS_TXEN_POS (10)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_FEM_BPS_TXEN_MASK (0x1)

#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED2_POS (11)
#define SYS_CPU_STORAGE_CONNECT_OP_SELECT_RESERVED2_MASK (0x1fffff)

#define SYS_CPU_CURRENT_RUN_STATUS_ADDR (SOC_SYSTEM_REG_BASE + (0x3 << 2))

#define SYS_CPU_CURRENT_RUN_STATUS_CORE0_HALTED_POS (0)
#define SYS_CPU_CURRENT_RUN_STATUS_CORE0_HALTED_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_1_1_POS (1)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED_BIT_1_1_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED0_POS (2)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED0_MASK (0x3)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_SW_RESET_POS (4)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_SW_RESET_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED1_POS (5)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED1_MASK (0x7)

#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_PWR_DW_STATE_POS (8)
#define SYS_CPU_CURRENT_RUN_STATUS_CPU0_PWR_DW_STATE_MASK (0x1)

#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED2_POS (9)
#define SYS_CPU_CURRENT_RUN_STATUS_RESERVED2_MASK (0x7fffff)

#define SYS_CPU0_INT_HALT_CLK_OP_ADDR (SOC_SYSTEM_REG_BASE + (0x4 << 2))

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SW_RST_POS (0)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SW_RST_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_PWR_DW_POS (1)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_PWR_DW_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_INT_MASK_POS (2)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_INT_MASK_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_HALT_POS (3)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_HALT_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SPEED_POS (4)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_SPEED_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_RXEVT_SEL_POS (5)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_RXEVT_SEL_MASK (0x1)

#define SYS_CPU0_INT_HALT_CLK_OP_RESERVED_6_7_POS (6)
#define SYS_CPU0_INT_HALT_CLK_OP_RESERVED_6_7_MASK (0x3)

#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_OFFSET_POS (8)
#define SYS_CPU0_INT_HALT_CLK_OP_CPU0_OFFSET_MASK (0xffffff)

#define SYS_CPU_CLK_DIV_MODE1_ADDR (SOC_SYSTEM_REG_BASE + (0x8 << 2))

#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_CORE_POS (0)
#define SYS_CPU_CLK_DIV_MODE1_CLKDIV_CORE_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE1_CKSEL_CORE_POS (4)
#define SYS_CPU_CLK_DIV_MODE1_CKSEL_CORE_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE1_RSV_POS (5)
#define SYS_CPU_CLK_DIV_MODE1_RSV_MASK (0x7ffffff)

#define SYS_CPU_CLK_DIV_MODE2_ADDR (SOC_SYSTEM_REG_BASE + (0x9 << 2))

#define SYS_CPU_CLK_DIV_MODE2_RESERVED_0_3_POS (0)
#define SYS_CPU_CLK_DIV_MODE2_RESERVED_0_3_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_PSRAM_POS (4)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_PSRAM_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_PSRAM_POS (5)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_PSRAM_MASK (0x1)

#define SYS_CPU_CLK_DIV_MODE2_RESERVED_BIT_6_13_POS (6)
#define SYS_CPU_CLK_DIV_MODE2_RESERVED_BIT_6_13_MASK (0xff)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_SDIO_POS (14)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_SDIO_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SDIO_POS (16)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_SDIO_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_AUXS_POS (18)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_AUXS_MASK (0xf)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_AUXS_POS (22)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_AUXS_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKSEL_FLASH_POS (24)
#define SYS_CPU_CLK_DIV_MODE2_CKSEL_FLASH_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_FLASH_POS (26)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_FLASH_MASK (0x3)

#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S0_POS (28)
#define SYS_CPU_CLK_DIV_MODE2_CKDIV_I2S0_MASK (0x7)

#define SYS_CPU_CLK_DIV_MODE2_CLKDIV_AUXS_POS (31)
#define SYS_CPU_CLK_DIV_MODE2_CLKDIV_AUXS_MASK (0x1)

#define SYS_CPU_26M_WDT_CLK_DIV_ADDR (SOC_SYSTEM_REG_BASE + (0xa << 2))

#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_26M_POS (0)
#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_26M_MASK (0x3)

#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_WDT_POS (2)
#define SYS_CPU_26M_WDT_CLK_DIV_CKDIV_WDT_MASK (0x3)

#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI0_POS (4)
#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI0_MASK (0x3)

#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI1_POS (6)
#define SYS_CPU_26M_WDT_CLK_DIV_CLKSEL_SPI1_MASK (0x3)

