bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
#define SYS_CPU_DEVICE_MEM_CTRL2_SPI0_DS_POS (28)
#define SYS_CPU_DEVICE_MEM_CTRL2_SPI0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_ENC_DS_POS (29)
#define SYS_CPU_DEVICE_MEM_CTRL2_ENC_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_DMA0_DS_POS (30)
#define SYS_CPU_DEVICE_MEM_CTRL2_DMA0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED1_POS (31)
#define SYS_CPU_DEVICE_MEM_CTRL2_RESERVED1_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ADDR (SOC_SYSTEM_REG_BASE + (0x10 << 2))

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM1_POS (0)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM1_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM2_POS (1)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM2_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM3_POS (2)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM3_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_ENCP_POS (3)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_ENCP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BAKP_POS (4)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BAKP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_5_7_POS (5)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_5_7_MASK (0x7)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BTSP_POS (8)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_BTSP_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_MAC_POS (9)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_MAC_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_PHY_POS (10)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_WIFP_PHY_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM0_POS (11)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM0_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM4_POS (12)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_MEM4_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_OFDM_POS (13)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_OFDM_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_THREAD_POS (14)
#define SYS_CPU_POWER_SLEEP_WAKEUP_PWD_THREAD_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_PGEN_POS (15)
#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_PGEN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_POS (16)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_FLASH_IDLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_17_17_POS (17)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_17_17_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_POS (18)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_NEED_CPU0_WFI_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_POS (19)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_EN_GLOBAL_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_POS (20)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SLEEP_BUS_IDLE_BYPASS_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_21_21_POS (21)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_BIT_21_21_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_POS (22)
#define SYS_CPU_POWER_SLEEP_WAKEUP_BTS_SOFT_WAKEUP_REQ_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_POS (23)
#define SYS_CPU_POWER_SLEEP_WAKEUP_ROM_RD_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_POS (24)
#define SYS_CPU_POWER_SLEEP_WAKEUP_OTP_RD_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM0_PGEN_POS (25)
#define SYS_CPU_POWER_SLEEP_WAKEUP_TCM0_PGEN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_SUBPWDM_EN_POS (26)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_SUBPWDM_EN_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_TE200_CLKGAT_BPS_POS (27)
#define SYS_CPU_POWER_SLEEP_WAKEUP_TE200_CLKGAT_BPS_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_POS (28)
#define SYS_CPU_POWER_SLEEP_WAKEUP_SHARE_MEM_CLKGATING_DISABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_POS (29)
#define SYS_CPU_POWER_SLEEP_WAKEUP_CPU0_TICKTIMER_32K_ENABLE_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_30_30_POS (30)
#define SYS_CPU_POWER_SLEEP_WAKEUP_RESERVED_30_30_MASK (0x1)

#define SYS_CPU_POWER_SLEEP_WAKEUP_BUSMATRIX_BUSY_POS (31)
#define SYS_CPU_POWER_SLEEP_WAKEUP_BUSMATRIX_BUSY_MASK (0x1)

#define SYS_CPU0_LV_SLEEP_CFG_ADDR (SOC_SYSTEM_REG_BASE + (0x11 << 2))

#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_RET_EN_POS (0)
#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_RET_EN_MASK (0x1)

#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_SLEEPPWD_EN_POS (1)
#define SYS_CPU0_LV_SLEEP_CFG_CPU0_CACHE_SLEEPPWD_EN_MASK (0x1)

#define SYS_CPU0_LV_SLEEP_CFG_RESERVED_2_31_POS (2)
#define SYS_CPU0_LV_SLEEP_CFG_RESERVED_2_31_MASK (0x3fffffff)

#define SYS_CPU_DEVICE_MEM_CTRL3_ADDR (SOC_SYSTEM_REG_BASE + (0x12 << 2))

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_DS_POS (0)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM0_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_DS_POS (1)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM1_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_DS_POS (2)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM2_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_DS_POS (3)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM3_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_DS_POS (4)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM4_DS_MASK (0x1)

#define SYS_CPU_DEVICE_MEM_CTRL3_RESERVED0_POS (5)
#define SYS_CPU_DEVICE_MEM_CTRL3_RESERVED0_MASK (0x7ff)

#define SYS_CPU_DEVICE_MEM_CTRL3_RAM_CONFIG_POS (16)
#define SYS_CPU_DEVICE_MEM_CTRL3_RAM_CONFIG_MASK (0x3ff)

#define SYS_CPU_DEVICE_MEM_CTRL3_RESERVED1_POS (26)
#define SYS_CPU_DEVICE_MEM_CTRL3_RESERVED1_MASK (0x3f)

#define SYS_CPU0_INT_0_31_EN_ADDR (SOC_SYSTEM_REG_BASE + (0x20 << 2))

#define SYS_CPU0_INT_0_31_EN_CPU0_DMA_NSEC_INTR_EN_POS (0)
#define SYS_CPU0_INT_0_31_EN_CPU0_DMA_NSEC_INTR_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_SEC_INTR_EN_POS (1)
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_SEC_INTR_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_NSEC_INTR_EN_POS (2)
#define SYS_CPU0_INT_0_31_EN_CPU0_ENCP_NSEC_INTR_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER_INT_EN_POS (3)
#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_RESERVED_BIT_4_4_POS (4)
#define SYS_CPU0_INT_0_31_EN_RESERVED_BIT_4_4_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_PWM0_INT_EN_POS (5)
#define SYS_CPU0_INT_0_31_EN_CPU0_PWM0_INT_EN_MASK (0x1)

