bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C0_INT_EN_POS (6)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_SPI0_INT_EN_POS (7)
#define SYS_CPU0_INT_0_31_EN_CPU0_SPI0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_RESERVED_BIT_8_8_POS (8)
#define SYS_CPU0_INT_0_31_EN_RESERVED_BIT_8_8_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_UART3_INT_EN_POS (9)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_SDIO_INT_EN_POS (10)
#define SYS_CPU0_INT_0_31_EN_CPU0_SDIO_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_GDMA_INT_EN_POS (11)
#define SYS_CPU0_INT_0_31_EN_CPU0_GDMA_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_LA_INT_EN_POS (12)
#define SYS_CPU0_INT_0_31_EN_CPU0_LA_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER1_INT_EN_POS (13)
#define SYS_CPU0_INT_0_31_EN_CPU0_TIMER1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_I2C1_INT_EN_POS (14)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2C1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_UART1_INT_EN_POS (15)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_UART2_INT_EN_POS (16)
#define SYS_CPU0_INT_0_31_EN_CPU0_UART2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_SPI1_INT_EN_POS (17)
#define SYS_CPU0_INT_0_31_EN_CPU0_SPI1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_LED_INT_EN_POS (18)
#define SYS_CPU0_INT_0_31_EN_CPU0_LED_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_TAMPER_INT_EN_POS (19)
#define SYS_CPU0_INT_0_31_EN_CPU0_TAMPER_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_RESV1_INT_EN_POS (20)
#define SYS_CPU0_INT_0_31_EN_CPU0_RESV1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_CKMN_INT_EN_POS (21)
#define SYS_CPU0_INT_0_31_EN_CPU0_CKMN_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_RESV2_INT_EN_POS (22)
#define SYS_CPU0_INT_0_31_EN_CPU0_RESV2_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_RESV3_INT_EN_POS (23)
#define SYS_CPU0_INT_0_31_EN_CPU0_RESV3_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_I2S0_INT_EN_POS (24)
#define SYS_CPU0_INT_0_31_EN_CPU0_I2S0_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_RESV4_INT_EN_POS (25)
#define SYS_CPU0_INT_0_31_EN_CPU0_RESV4_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_RESV5_INT_EN_POS (26)
#define SYS_CPU0_INT_0_31_EN_CPU0_RESV5_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_RESV6_INT_EN_POS (27)
#define SYS_CPU0_INT_0_31_EN_CPU0_RESV6_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_RESV7_INT_EN_POS (28)
#define SYS_CPU0_INT_0_31_EN_CPU0_RESV7_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_INT_MAC_WAKEUP_INT_EN_POS (29)
#define SYS_CPU0_INT_0_31_EN_CPU0_INT_MAC_WAKEUP_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_HSU_IRQ_INT_EN_POS (30)
#define SYS_CPU0_INT_0_31_EN_CPU0_HSU_IRQ_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_0_31_EN_CPU0_MAC_INT_GEN_INT_EN_POS (31)
#define SYS_CPU0_INT_0_31_EN_CPU0_MAC_INT_GEN_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_ADDR (SOC_SYSTEM_REG_BASE + (0x21 << 2))

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_PORT_TRIGGER_INT_EN_POS (0)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_PORT_TRIGGER_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_TRIGGER_INT_EN_POS (1)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_TRIGGER_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_RX_TRIGGER_INT_EN_POS (2)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_RX_TRIGGER_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_RX_MISC_INT_EN_POS (3)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_RX_MISC_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_RX_TIMER_INT_EN_POS (4)
#define SYS_CPU0_INT_32_63_EN_CPU0_MAC_INT_TX_RX_TIMER_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_PHY_RIU_INT_INT_EN_POS (5)
#define SYS_CPU0_INT_32_63_EN_CPU0_PHY_RIU_INT_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_PHY_MBP_INT_INT_EN_POS (6)
#define SYS_CPU0_INT_32_63_EN_CPU0_PHY_MBP_INT_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_BT_IRQ_INT_EN_POS (7)
#define SYS_CPU0_INT_32_63_EN_CPU0_BT_IRQ_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_BLE_IRQ_INT_EN_POS (8)
#define SYS_CPU0_INT_32_63_EN_CPU0_BLE_IRQ_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DM_IRQ_INT_EN_POS (9)
#define SYS_CPU0_INT_32_63_EN_CPU0_DM_IRQ_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_QSPI1_INT_EN_POS (10)
#define SYS_CPU0_INT_32_63_EN_CPU0_QSPI1_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV8_INT_EN_POS (11)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV8_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV9_INT_EN_POS (12)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV9_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV10_INT_EN_POS (13)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV10_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV11_INT_EN_POS (14)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV11_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV12_INT_EN_POS (15)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV12_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_THREAD_INT_EN_POS (16)
#define SYS_CPU0_INT_32_63_EN_CPU0_THREAD_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV13_INT_EN_POS (17)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV13_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_OTP_INT_EN_POS (18)
#define SYS_CPU0_INT_32_63_EN_CPU0_OTP_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_DPLLUNLOCK_INT_EN_POS (19)
#define SYS_CPU0_INT_32_63_EN_CPU0_DPLLUNLOCK_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV14_INT_EN_POS (20)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV14_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV15_INT_EN_POS (21)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV15_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_RESV16_INT_EN_POS (22)
#define SYS_CPU0_INT_32_63_EN_CPU0_RESV16_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_S_INT_EN_POS (23)
#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_S_INT_EN_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_NS_INT_EN_POS (24)
#define SYS_CPU0_INT_32_63_EN_CPU0_GPIO_NS_INT_EN_MASK (0x1)

