bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
#define SYS_CPU0_INT_32_63_EN_RESV25_POS (25)
#define SYS_CPU0_INT_32_63_EN_RESV25_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_ANA_GPIO_POS (26)
#define SYS_CPU0_INT_32_63_EN_ANA_GPIO_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_ANA_RTC_POS (27)
#define SYS_CPU0_INT_32_63_EN_ANA_RTC_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_ABNORMAL_GPIO_POS (28)
#define SYS_CPU0_INT_32_63_EN_ABNORMAL_GPIO_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_ABNORMAL_RTC_POS (29)
#define SYS_CPU0_INT_32_63_EN_ABNORMAL_RTC_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_RESV30_POS (30)
#define SYS_CPU0_INT_32_63_EN_RESV30_MASK (0x1)

#define SYS_CPU0_INT_32_63_EN_RESV31_POS (31)
#define SYS_CPU0_INT_32_63_EN_RESV31_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_ADDR (SOC_SYSTEM_REG_BASE + (0x28 << 2))

#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA_NSEC_INTR_ST_POS (0)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_DMA_NSEC_INTR_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_SEC_INTR_ST_POS (1)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_SEC_INTR_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_NSEC_INTR_ST_POS (2)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_ENCP_NSEC_INTR_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER_INT_ST_POS (3)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_RESERVED_BIT_4_4_POS (4)
#define SYS_CPU0_INT_0_31_STATUS_RESERVED_BIT_4_4_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_PWM0_INT_ST_POS (5)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_PWM0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C0_INT_ST_POS (6)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI0_INT_ST_POS (7)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_RESERVED_BIT_8_8_POS (8)
#define SYS_CPU0_INT_0_31_STATUS_RESERVED_BIT_8_8_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART3_INT_ST_POS (9)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SDIO_INT_ST_POS (10)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SDIO_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_GDMA_INT_ST_POS (11)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_GDMA_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_LA_INT_ST_POS (12)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_LA_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER1_INT_ST_POS (13)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_TIMER1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C1_INT_ST_POS (14)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2C1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART1_INT_ST_POS (15)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART2_INT_ST_POS (16)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_UART2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI1_INT_ST_POS (17)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_SPI1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_LED_INT_ST_POS (18)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_LED_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV0_INT_ST_POS (19)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV1_INT_ST_POS (20)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_CKMN_INT_ST_POS (21)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_CKMN_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV2_INT_ST_POS (22)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV2_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV3_INT_ST_POS (23)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV3_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S0_INT_ST_POS (24)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_I2S0_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV4_INT_ST_POS (25)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV4_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV5_INT_ST_POS (26)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV5_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV6_INT_ST_POS (27)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV6_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV7_INT_ST_POS (28)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_RESV7_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_INT_MAC_WAKEUP_INT_ST_POS (29)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_INT_MAC_WAKEUP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_HSU_IRQ_INT_ST_POS (30)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_HSU_IRQ_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_0_31_STATUS_CPU0_MAC_INT_GEN_INT_ST_POS (31)
#define SYS_CPU0_INT_0_31_STATUS_CPU0_MAC_INT_GEN_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_ADDR (SOC_SYSTEM_REG_BASE + (0x29 << 2))

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_PORT_TRIGGER_INT_ST_POS (0)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_PORT_TRIGGER_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_TRIGGER_INT_ST_POS (1)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_TRIGGER_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_RX_TRIGGER_INT_ST_POS (2)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_RX_TRIGGER_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_RX_MISC_INT_ST_POS (3)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_RX_MISC_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_RX_TIMER_INT_ST_POS (4)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_MAC_INT_TX_RX_TIMER_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_PHY_RIU_INT_INT_ST_POS (5)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_PHY_RIU_INT_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_PHY_MBP_INT_INT_ST_POS (6)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_PHY_MBP_INT_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BT_IRQ_INT_ST_POS (7)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BT_IRQ_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_BLE_IRQ_INT_ST_POS (8)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_BLE_IRQ_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DM_IRQ_INT_ST_POS (9)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DM_IRQ_INT_ST_MASK (0x1)

