bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
#define SYS_CPU0_INT_32_63_STATUS_CPU0_QSPI1_INT_ST_POS (10)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_QSPI1_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV8_INT_ST_POS (11)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV8_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV9_INT_ST_POS (12)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV9_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV10_INT_ST_POS (13)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV10_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV11_INT_ST_POS (14)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV11_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV12_INT_ST_POS (15)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV12_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_THREAD_INT_ST_POS (16)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_THREAD_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV13_INT_ST_POS (17)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV13_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_OTP_INT_ST_POS (18)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_OTP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLLUNLOCK_INT_ST_POS (19)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_DPLLUNLOCK_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV14_INT_ST_POS (20)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV14_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV15_INT_ST_POS (21)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV15_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV16_INT_ST_POS (22)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_RESV16_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_S_INT_ST_POS (23)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_S_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_NS_INT_ST_POS (24)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_GPIO_NS_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_CPU0_ANA3V_WAKEUP_INT_ST_POS (25)
#define SYS_CPU0_INT_32_63_STATUS_CPU0_ANA3V_WAKEUP_INT_ST_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV26_POS (26)
#define SYS_CPU0_INT_32_63_STATUS_RESV26_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV27_POS (27)
#define SYS_CPU0_INT_32_63_STATUS_RESV27_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV28_POS (28)
#define SYS_CPU0_INT_32_63_STATUS_RESV28_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV29_POS (29)
#define SYS_CPU0_INT_32_63_STATUS_RESV29_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV30_POS (30)
#define SYS_CPU0_INT_32_63_STATUS_RESV30_MASK (0x1)

#define SYS_CPU0_INT_32_63_STATUS_RESV31_POS (31)
#define SYS_CPU0_INT_32_63_STATUS_RESV31_MASK (0x1)

#define SYS_GPIO_CONFIG0_ADDR (SOC_SYSTEM_REG_BASE + (0x30 << 2))

#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_POS (0)
#define SYS_GPIO_CONFIG0_GPIO_CONFIG0_MASK (0xffffffff)

#define SYS_GPIO_CONFIG1_ADDR (SOC_SYSTEM_REG_BASE + (0x31 << 2))

#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_POS (0)
#define SYS_GPIO_CONFIG1_GPIO_CONFIG1_MASK (0xffffffff)

#define SYS_GPIO_CONFIG2_ADDR (SOC_SYSTEM_REG_BASE + (0x32 << 2))

#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_POS (0)
#define SYS_GPIO_CONFIG2_GPIO_CONFIG2_MASK (0xffffffff)

//TODO 
#define SYS_SYS_DEBUG_CONFIG1_ADDR (0)
#define SYS_SYS_DEBUG_CONFIG0_ADDR (SOC_SYSTEM_REG_BASE + (0x38 << 2))

#define SYS_DBUG_CONFIG0_ADDR (SOC_SYSTEM_REG_BASE + (0x38 << 2))

#define SYS_DBUG_CONFIG0_DBUG_MSG_POS (0)
#define SYS_DBUG_CONFIG0_DBUG_MSG_MASK (0xffff)

#define SYS_DBUG_CONFIG0_DBUG_MUX_POS (16)
#define SYS_DBUG_CONFIG0_DBUG_MUX_MASK (0xf)

#define SYS_DBUG_CONFIG0_RESERVED_20_31_POS (20)
#define SYS_DBUG_CONFIG0_RESERVED_20_31_MASK (0xfff)

#define SYS_ANAREG_STAT_ADDR (SOC_SYSTEM_REG_BASE + (0x3a << 2))

#define SYS_ANAREG_STAT_ANAREG_STAT_POS (0)
#define SYS_ANAREG_STAT_ANAREG_STAT_MASK (0xffffffff)


#define SYS_ANA_REG0_ADDR (SOC_SYS_REG_BASE + (0x40 << 2))

#define SYS_ANA_REG0_NC_0_6_POS (0)
#define SYS_ANA_REG0_NC_0_6_MASK (0x7f)

#define SYS_ANA_REG0_CP_POS (7)
#define SYS_ANA_REG0_CP_MASK (0x7)

#define SYS_ANA_REG0_SPIDETEN_POS (10)
#define SYS_ANA_REG0_SPIDETEN_MASK (0x1)

#define SYS_ANA_REG0_CBEN_POS (11)
#define SYS_ANA_REG0_CBEN_MASK (0x1)

#define SYS_ANA_REG0_HVREF_POS (12)
#define SYS_ANA_REG0_HVREF_MASK (0x3)

#define SYS_ANA_REG0_LVREF_POS (14)
#define SYS_ANA_REG0_LVREF_MASK (0x3)

#define SYS_ANA_REG0_RZCTRL26M_POS (16)
#define SYS_ANA_REG0_RZCTRL26M_MASK (0x1)

#define SYS_ANA_REG0_LPF_RZ_POS (17)
#define SYS_ANA_REG0_LPF_RZ_MASK (0xf)

#define SYS_ANA_REG0_RPC_POS (21)
#define SYS_ANA_REG0_RPC_MASK (0x3)

#define SYS_ANA_REG0_DPLL_TSTEN_POS (23)
#define SYS_ANA_REG0_DPLL_TSTEN_MASK (0x1)

#define SYS_ANA_REG0_DIVSEL_POS (24)
#define SYS_ANA_REG0_DIVSEL_MASK (0x3)

#define SYS_ANA_REG0_KCTRL_POS (26)
#define SYS_ANA_REG0_KCTRL_MASK (0x3)

#define SYS_ANA_REG0_VSEL_LDO_POS (28)
#define SYS_ANA_REG0_VSEL_LDO_MASK (0x3)

#define SYS_ANA_REG0_BP_CALDONE_POS (30)
#define SYS_ANA_REG0_BP_CALDONE_MASK (0x1)

#define SYS_ANA_REG0_NC_31_31_POS (31)
#define SYS_ANA_REG0_NC_31_31_MASK (0x1)

#define SYS_ANA_REG1_ADDR (SOC_SYS_REG_BASE + (0x41 << 2))

#define SYS_ANA_REG1_NC_0_0_POS (0)
#define SYS_ANA_REG1_NC_0_0_MASK (0x1)

#define SYS_ANA_REG1_BANDMANUAL_POS (1)
#define SYS_ANA_REG1_BANDMANUAL_MASK (0x1ff)

#define SYS_ANA_REG1_NC_10_10_POS (10)
#define SYS_ANA_REG1_NC_10_10_MASK (0x1)

#define SYS_ANA_REG1_ENCLK_POS (11)
#define SYS_ANA_REG1_ENCLK_MASK (0x1)

#define SYS_ANA_REG1_CLOSELOOP_EN_POS (12)
#define SYS_ANA_REG1_CLOSELOOP_EN_MASK (0x1)

#define SYS_ANA_REG1_MODECAL_POS (13)
#define SYS_ANA_REG1_MODECAL_MASK (0x1)

#define SYS_ANA_REG1_SPI_RSTN_POS (14)
#define SYS_ANA_REG1_SPI_RSTN_MASK (0x1)

#define SYS_ANA_REG1_OSCCAL_TRIG_POS (15)
#define SYS_ANA_REG1_OSCCAL_TRIG_MASK (0x1)

#define SYS_ANA_REG1_MANUAL_POS (16)
#define SYS_ANA_REG1_MANUAL_MASK (0x1)

#define SYS_ANA_REG1_DIFFL_POS (17)
#define SYS_ANA_REG1_DIFFL_MASK (0x7)

#define SYS_ANA_REG1_ICTRL_POS (20)
#define SYS_ANA_REG1_ICTRL_MASK (0x7)

#define SYS_ANA_REG1_CNTI_POS (23)
#define SYS_ANA_REG1_CNTI_MASK (0x1ff)

#define SYS_ANA_REG2_ADDR (SOC_SYS_REG_BASE + (0x42 << 2))

#define SYS_ANA_REG2_XTALH_CTUNE_POS (0)
#define SYS_ANA_REG2_XTALH_CTUNE_MASK (0xff)

#define SYS_ANA_REG2_FORCE_40MPLL_POS (8)
#define SYS_ANA_REG2_FORCE_40MPLL_MASK (0x1)

#define SYS_ANA_REG2_GADC_CMP_ICTRL_POS (9)
#define SYS_ANA_REG2_GADC_CMP_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_INBUF_ICTRL_POS (11)
#define SYS_ANA_REG2_GADC_INBUF_ICTRL_MASK (0x3)

#define SYS_ANA_REG2_GADC_REFBUF_ICTRL_POS (13)
#define SYS_ANA_REG2_GADC_REFBUF_ICTRL_MASK (0x3)

