bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
#define SYS_ANA_REG2_GADC_LDO_EN_POS (15)
#define SYS_ANA_REG2_GADC_LDO_EN_MASK (0x1)

#define SYS_ANA_REG2_VREF_SCALE_POS (16)
#define SYS_ANA_REG2_VREF_SCALE_MASK (0x1)

#define SYS_ANA_REG2_SCAL_EN_POS (17)
#define SYS_ANA_REG2_SCAL_EN_MASK (0x1)

#define SYS_ANA_REG2_GADC_CAPCAL_EN_POS (18)
#define SYS_ANA_REG2_GADC_CAPCAL_EN_MASK (0x1)

#define SYS_ANA_REG2_GADC_CAPCAL_POS (19)
#define SYS_ANA_REG2_GADC_CAPCAL_MASK (0x3f)

#define SYS_ANA_REG2_SP_NT_CTRL_POS (25)
#define SYS_ANA_REG2_SP_NT_CTRL_MASK (0x7f)

#define SYS_ANA_REG3_ADDR (SOC_SYS_REG_BASE + (0x43 << 2))

#define SYS_ANA_REG3_LBW0V9_POS (0)
#define SYS_ANA_REG3_LBW0V9_MASK (0x1)

#define SYS_ANA_REG3_SDCLK_SEL_POS (1)
#define SYS_ANA_REG3_SDCLK_SEL_MASK (0x1)

#define SYS_ANA_REG3_SARRLCK_RLTEN_POS (2)
#define SYS_ANA_REG3_SARRLCK_RLTEN_MASK (0x1)

#define SYS_ANA_REG3_SARRLCK_INV_POS (3)
#define SYS_ANA_REG3_SARRLCK_INV_MASK (0x1)

#define SYS_ANA_REG3_BUFDRVTRM0V9_POS (4)
#define SYS_ANA_REG3_BUFDRVTRM0V9_MASK (0x1)

#define SYS_ANA_REG3_NC_5_5_POS (5)
#define SYS_ANA_REG3_NC_5_5_MASK (0x1)

#define SYS_ANA_REG3_INBUFEN0V9_POS (6)
#define SYS_ANA_REG3_INBUFEN0V9_MASK (0x1)

#define SYS_ANA_REG3_HRES_SEL0V9_POS (7)
#define SYS_ANA_REG3_HRES_SEL0V9_MASK (0x1)

#define SYS_ANA_REG3_HPSSREN_POS (8)
#define SYS_ANA_REG3_HPSSREN_MASK (0x1)

#define SYS_ANA_REG3_CK_SEL_POS (9)
#define SYS_ANA_REG3_CK_SEL_MASK (0x1)

#define SYS_ANA_REG3_ANABUF_SEL_TX_POS (10)
#define SYS_ANA_REG3_ANABUF_SEL_TX_MASK (0x1)

#define SYS_ANA_REG3_AMPBIAS_OUTEN_POS (11)
#define SYS_ANA_REG3_AMPBIAS_OUTEN_MASK (0x1)

#define SYS_ANA_REG3_IAMP_POS (12)
#define SYS_ANA_REG3_IAMP_MASK (0x1)

#define SYS_ANA_REG3_VDDREN_POS (13)
#define SYS_ANA_REG3_VDDREN_MASK (0x1)

#define SYS_ANA_REG3_XAMP_POS (14)
#define SYS_ANA_REG3_XAMP_MASK (0x3f)

#define SYS_ANA_REG3_VOSEL_POS (20)
#define SYS_ANA_REG3_VOSEL_MASK (0x1f)

#define SYS_ANA_REG3_EN_XTALH_SLEEP_POS (25)
#define SYS_ANA_REG3_EN_XTALH_SLEEP_MASK (0x1)

#define SYS_ANA_REG3_XTAL40_EN_POS (26)
#define SYS_ANA_REG3_XTAL40_EN_MASK (0x1)

#define SYS_ANA_REG3_BUFICTRL_POS (27)
#define SYS_ANA_REG3_BUFICTRL_MASK (0x1)

#define SYS_ANA_REG3_IBIAS_CTRL_POS (28)
#define SYS_ANA_REG3_IBIAS_CTRL_MASK (0x3)

#define SYS_ANA_REG3_ICORE_CTRL_POS (30)
#define SYS_ANA_REG3_ICORE_CTRL_MASK (0x3)

#define SYS_ANA_REG4_ADDR (SOC_SYS_REG_BASE + (0x44 << 2))

#define SYS_ANA_REG4_ANABUF_SEL_RX_POS (0)
#define SYS_ANA_REG4_ANABUF_SEL_RX_MASK (0x1)

#define SYS_ANA_REG4_NC_1_1_POS (1)
#define SYS_ANA_REG4_NC_1_1_MASK (0x1)

#define SYS_ANA_REG4_PMU_TEST_POS (2)
#define SYS_ANA_REG4_PMU_TEST_MASK (0x1)

#define SYS_ANA_REG4_NC_3_15_POS (3)
#define SYS_ANA_REG4_NC_3_15_MASK (0x1fff)

#define SYS_ANA_REG4_PWD_ANABUF_LOWNOISE_POS (16)
#define SYS_ANA_REG4_PWD_ANABUF_LOWNOISE_MASK (0x1)

#define SYS_ANA_REG4_NC_17_19_POS (17)
#define SYS_ANA_REG4_NC_17_19_MASK (0x7)

#define SYS_ANA_REG4_CKTST_SEL_POS (20)
#define SYS_ANA_REG4_CKTST_SEL_MASK (0x3)

#define SYS_ANA_REG4_CK_TST_ENBALE_POS (22)
#define SYS_ANA_REG4_CK_TST_ENBALE_MASK (0x1)

#define SYS_ANA_REG4_NC_23_27_POS (23)
#define SYS_ANA_REG4_NC_23_27_MASK (0x1f)

#define SYS_ANA_REG4_VPSRAMSEL_POS (28)
#define SYS_ANA_REG4_VPSRAMSEL_MASK (0x3)

#define SYS_ANA_REG4_SWB_POS (30)
#define SYS_ANA_REG4_SWB_MASK (0x1)

#define SYS_ANA_REG4_EN_PSRAMLDO_POS (31)
#define SYS_ANA_REG4_EN_PSRAMLDO_MASK (0x1)

#define SYS_ANA_REG5_ADDR (SOC_SYS_REG_BASE + (0x45 << 2))

#define SYS_ANA_REG5_NC_0_0_POS (0)
#define SYS_ANA_REG5_NC_0_0_MASK (0x1)

#define SYS_ANA_REG5_EN_XTALL_POS (1)
#define SYS_ANA_REG5_EN_XTALL_MASK (0x1)

#define SYS_ANA_REG5_NC_2_2_POS (2)
#define SYS_ANA_REG5_NC_2_2_MASK (0x1)

#define SYS_ANA_REG5_NC_3_3_POS (3)
#define SYS_ANA_REG5_NC_3_3_MASK (0x1)

#define SYS_ANA_REG5_EN_TEMP_POS (4)
#define SYS_ANA_REG5_EN_TEMP_MASK (0x1)

#define SYS_ANA_REG5_EN_DPLL_POS (5)
#define SYS_ANA_REG5_EN_DPLL_MASK (0x1)

#define SYS_ANA_REG5_EN_CB_POS (6)
#define SYS_ANA_REG5_EN_CB_MASK (0x1)

#define SYS_ANA_REG5_NC_7_7_POS (7)
#define SYS_ANA_REG5_NC_7_7_MASK (0x1)

#define SYS_ANA_REG5_NC_8_9_POS (8)
#define SYS_ANA_REG5_NC_8_9_MASK (0x3)

#define SYS_ANA_REG5_ADC_DIV_POS (10)
#define SYS_ANA_REG5_ADC_DIV_MASK (0x3)

#define SYS_ANA_REG5_ROSC_DISABLE_POS (12)
#define SYS_ANA_REG5_ROSC_DISABLE_MASK (0x1)

#define SYS_ANA_REG5_NC_13_13_POS (13)
#define SYS_ANA_REG5_NC_13_13_MASK (0x1)

#define SYS_ANA_REG5_PWD_ROSC_SPI_POS (14)
#define SYS_ANA_REG5_PWD_ROSC_SPI_MASK (0x1)

#define SYS_ANA_REG5_NC_15_15_POS (15)
#define SYS_ANA_REG5_NC_15_15_MASK (0x1)

#define SYS_ANA_REG5_ITUNE_XTALL_POS (16)
#define SYS_ANA_REG5_ITUNE_XTALL_MASK (0xf)

#define SYS_ANA_REG5_XTALL_TEN_POS (20)
#define SYS_ANA_REG5_XTALL_TEN_MASK (0x1)

#define SYS_ANA_REG5_ROSC_TSTEN_POS (21)
#define SYS_ANA_REG5_ROSC_TSTEN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_START_POS (22)
#define SYS_ANA_REG5_BCAL_START_MASK (0x1)

#define SYS_ANA_REG5_BCAL_EN_POS (23)
#define SYS_ANA_REG5_BCAL_EN_MASK (0x1)

#define SYS_ANA_REG5_BCAL_SEL_POS (24)
#define SYS_ANA_REG5_BCAL_SEL_MASK (0x7)

#define SYS_ANA_REG5_VBIAS_POS (27)
#define SYS_ANA_REG5_VBIAS_MASK (0x1f)

#define SYS_ANA_REG6_ADDR (SOC_SYS_REG_BASE + (0x46 << 2))

#define SYS_ANA_REG6_CALIB_INTERVAL_POS (0)
#define SYS_ANA_REG6_CALIB_INTERVAL_MASK (0x3ff)

#define SYS_ANA_REG6_MODIFY_INTERVAL_POS (10)
#define SYS_ANA_REG6_MODIFY_INTERVAL_MASK (0x3f)

#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_POS (16)
#define SYS_ANA_REG6_XTAL_WAKEUP_TIME_MASK (0xf)

#define SYS_ANA_REG6_SPI_TRIG_POS (20)
#define SYS_ANA_REG6_SPI_TRIG_MASK (0x1)

#define SYS_ANA_REG6_MODIFI_AUTO_POS (21)
#define SYS_ANA_REG6_MODIFI_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CALIB_AUTO_POS (22)
#define SYS_ANA_REG6_CALIB_AUTO_MASK (0x1)

#define SYS_ANA_REG6_CAL_MODE_POS (23)
#define SYS_ANA_REG6_CAL_MODE_MASK (0x1)

#define SYS_ANA_REG6_MANU_ENA_POS (24)
#define SYS_ANA_REG6_MANU_ENA_MASK (0x1)

#define SYS_ANA_REG6_MANU_CIN_POS (25)
#define SYS_ANA_REG6_MANU_CIN_MASK (0x7f)

#define SYS_ANA_REG7_ADDR (SOC_SYS_REG_BASE + (0x47 << 2))

#define SYS_ANA_REG7_CLK_SEL_POS (0)
#define SYS_ANA_REG7_CLK_SEL_MASK (0x1)

