bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
#define SYS_ANA_REG7_NC_1_1_POS (1)
#define SYS_ANA_REG7_NC_1_1_MASK (0x1)

#define SYS_ANA_REG7_DLDOHP_POS (2)
#define SYS_ANA_REG7_DLDOHP_MASK (0x1)

#define SYS_ANA_REG7_T_VANALDOSEL_POS (3)
#define SYS_ANA_REG7_T_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG7_R_VANALDOSEL_POS (6)
#define SYS_ANA_REG7_R_VANALDOSEL_MASK (0x7)

#define SYS_ANA_REG7_EN_TRSW_POS (9)
#define SYS_ANA_REG7_EN_TRSW_MASK (0x1)

#define SYS_ANA_REG7_ALDOHP_POS (10)
#define SYS_ANA_REG7_ALDOHP_MASK (0x1)

#define SYS_ANA_REG7_ANACURLIM_POS (11)
#define SYS_ANA_REG7_ANACURLIM_MASK (0x1)

#define SYS_ANA_REG7_ENVREFH1V_POS (12)
#define SYS_ANA_REG7_ENVREFH1V_MASK (0x1)

#define SYS_ANA_REG7_NC_13_15_POS (13)
#define SYS_ANA_REG7_NC_13_15_MASK (0x7)

#define SYS_ANA_REG7_VALOLDOSEL_POS (16)
#define SYS_ANA_REG7_VALOLDOSEL_MASK (0x7)

#define SYS_ANA_REG7_SPI_PWD_REGPOW_POS (19)
#define SYS_ANA_REG7_SPI_PWD_REGPOW_MASK (0x1)

#define SYS_ANA_REG7_NC_20_21_POS (20)
#define SYS_ANA_REG7_NC_20_21_MASK (0x3)

#define SYS_ANA_REG7_BGCAL_POS (22)
#define SYS_ANA_REG7_BGCAL_MASK (0x3f)

#define SYS_ANA_REG7_VBGCALMODE_POS (28)
#define SYS_ANA_REG7_VBGCALMODE_MASK (0x1)

#define SYS_ANA_REG7_VBGCALSTART_POS (29)
#define SYS_ANA_REG7_VBGCALSTART_MASK (0x1)

#define SYS_ANA_REG7_PWD_BGCAL_POS (30)
#define SYS_ANA_REG7_PWD_BGCAL_MASK (0x1)

#define SYS_ANA_REG7_SPI_ENVBG_POS (31)
#define SYS_ANA_REG7_SPI_ENVBG_MASK (0x1)

#define SYS_ANA_REG8_ADDR (SOC_SYS_REG_BASE + (0x48 << 2))

#define SYS_ANA_REG8_ASOFT_STC_POS (0)
#define SYS_ANA_REG8_ASOFT_STC_MASK (0xf)

#define SYS_ANA_REG8_RST_WKS1V_POS (4)
#define SYS_ANA_REG8_RST_WKS1V_MASK (0x1)

#define SYS_ANA_REG8_DLDO_CZSEL_POS (5)
#define SYS_ANA_REG8_DLDO_CZSEL_MASK (0x7)

#define SYS_ANA_REG8_DIGCURLIM_POS (8)
#define SYS_ANA_REG8_DIGCURLIM_MASK (0x1)

#define SYS_ANA_REG8_SPI_LATCH1V_POS (9)
#define SYS_ANA_REG8_SPI_LATCH1V_MASK (0x1)

#define SYS_ANA_REG8_DLDO_RZSEL_POS (10)
#define SYS_ANA_REG8_DLDO_RZSEL_MASK (0x3)

#define SYS_ANA_REG8_LVSLEEP_WKRST_POS (12)
#define SYS_ANA_REG8_LVSLEEP_WKRST_MASK (0x1)

#define SYS_ANA_REG8_GPIOWK_RSTN_POS (13)
#define SYS_ANA_REG8_GPIOWK_RSTN_MASK (0x1)

#define SYS_ANA_REG8_RTCWK_RSTN_POS (14)
#define SYS_ANA_REG8_RTCWK_RSTN_MASK (0x1)

#define SYS_ANA_REG8_ENSFSDD_POS (15)
#define SYS_ANA_REG8_ENSFSDD_MASK (0x1)

#define SYS_ANA_REG8_VCOREHSEL_POS (16)
#define SYS_ANA_REG8_VCOREHSEL_MASK (0xf)

#define SYS_ANA_REG8_VCORELSEL_POS (20)
#define SYS_ANA_REG8_VCORELSEL_MASK (0x7)

#define SYS_ANA_REG8_VLDEN_POS (23)
#define SYS_ANA_REG8_VLDEN_MASK (0x1)

#define SYS_ANA_REG8_PWDOVP1V_POS (24)
#define SYS_ANA_REG8_PWDOVP1V_MASK (0x1)

#define SYS_ANA_REG8_ALDO_RZSEL_POS (25)
#define SYS_ANA_REG8_ALDO_RZSEL_MASK (0x3)

#define SYS_ANA_REG8_ALDO_CZSEL_POS (27)
#define SYS_ANA_REG8_ALDO_CZSEL_MASK (0x7)

#define SYS_ANA_REG8_VTRXSPISEL_POS (30)
#define SYS_ANA_REG8_VTRXSPISEL_MASK (0x3)

#define SYS_ANA_REG9_ADDR (SOC_SYS_REG_BASE + (0x49 << 2))

#define SYS_ANA_REG9_AZCD_MANU_POS (0)
#define SYS_ANA_REG9_AZCD_MANU_MASK (0x3f)

#define SYS_ANA_REG9_ZCDSWVS_POS (6)
#define SYS_ANA_REG9_ZCDSWVS_MASK (0x7)

#define SYS_ANA_REG9_ZCDSREFSEL_POS (9)
#define SYS_ANA_REG9_ZCDSREFSEL_MASK (0x7)

#define SYS_ANA_REG9_ENZCDCALIB_POS (12)
#define SYS_ANA_REG9_ENZCDCALIB_MASK (0x1)

#define SYS_ANA_REG9_ENZCDDY_POS (13)
#define SYS_ANA_REG9_ENZCDDY_MASK (0x1)

#define SYS_ANA_REG9_ZCDMSEL_POS (14)
#define SYS_ANA_REG9_ZCDMSEL_MASK (0x1)

#define SYS_ANA_REG9_SPI_TIMERWKEN_POS (15)
#define SYS_ANA_REG9_SPI_TIMERWKEN_MASK (0x1)

#define SYS_ANA_REG9_SPI_BYP32PWD_POS (16)
#define SYS_ANA_REG9_SPI_BYP32PWD_MASK (0x1)

#define SYS_ANA_REG9_SD_POS (17)
#define SYS_ANA_REG9_SD_MASK (0x1)

#define SYS_ANA_REG9_NC_18_18_POS (18)
#define SYS_ANA_REG9_NC_18_18_MASK (0x1)

#define SYS_ANA_REG9_NC_19_19_POS (19)
#define SYS_ANA_REG9_NC_19_19_MASK (0x1)

#define SYS_ANA_REG9_CKFS_POS (20)
#define SYS_ANA_REG9_CKFS_MASK (0x3)

#define SYS_ANA_REG9_CKINTSEL_POS (22)
#define SYS_ANA_REG9_CKINTSEL_MASK (0x1)

#define SYS_ANA_REG9_OSCCALTRIG_POS (23)
#define SYS_ANA_REG9_OSCCALTRIG_MASK (0x1)

#define SYS_ANA_REG9_MROSCSEL_POS (24)
#define SYS_ANA_REG9_MROSCSEL_MASK (0x1)

#define SYS_ANA_REG9_MROSCI_CAL_POS (25)
#define SYS_ANA_REG9_MROSCI_CAL_MASK (0x7)

#define SYS_ANA_REG9_MROSCCAP_CAL_POS (28)
#define SYS_ANA_REG9_MROSCCAP_CAL_MASK (0xf)

#define SYS_ANA_REG10_ADDR (SOC_SYS_REG_BASE + (0x4a << 2))

#define SYS_ANA_REG10_SFSR_POS (0)
#define SYS_ANA_REG10_SFSR_MASK (0xf)

#define SYS_ANA_REG10_ENSFSAA_POS (4)
#define SYS_ANA_REG10_ENSFSAA_MASK (0x1)

#define SYS_ANA_REG10_APFMS_POS (5)
#define SYS_ANA_REG10_APFMS_MASK (0x1f)

#define SYS_ANA_REG10_ATMPO_SEL_POS (10)
#define SYS_ANA_REG10_ATMPO_SEL_MASK (0x3)

#define SYS_ANA_REG10_AMPOEN_POS (12)
#define SYS_ANA_REG10_AMPOEN_MASK (0x1)

#define SYS_ANA_REG10_NC_13_13_POS (13)
#define SYS_ANA_REG10_NC_13_13_MASK (0x1)

#define SYS_ANA_REG10_AVEA_SEL_POS (14)
#define SYS_ANA_REG10_AVEA_SEL_MASK (0x3)

#define SYS_ANA_REG10_AFORCEPFM_POS (16)
#define SYS_ANA_REG10_AFORCEPFM_MASK (0x1)

#define SYS_ANA_REG10_ACLS_POS (17)
#define SYS_ANA_REG10_ACLS_MASK (0x7)

#define SYS_ANA_REG10_ASWRSTEN_POS (20)
#define SYS_ANA_REG10_ASWRSTEN_MASK (0x1)

#define SYS_ANA_REG10_ARIPC_POS (21)
#define SYS_ANA_REG10_ARIPC_MASK (0x7)

#define SYS_ANA_REG10_ARAMPC_POS (24)
#define SYS_ANA_REG10_ARAMPC_MASK (0xf)

#define SYS_ANA_REG10_ARAMPCEN_POS (28)
#define SYS_ANA_REG10_ARAMPCEN_MASK (0x1)

#define SYS_ANA_REG10_AENBURST_POS (29)
#define SYS_ANA_REG10_AENBURST_MASK (0x1)

#define SYS_ANA_REG10_APFMEN_POS (30)
#define SYS_ANA_REG10_APFMEN_MASK (0x1)

#define SYS_ANA_REG10_ALDOSEL_POS (31)
#define SYS_ANA_REG10_ALDOSEL_MASK (0x1)

#define SYS_ANA_REG11_ADDR (SOC_SYS_REG_BASE + (0x4b << 2))

#define SYS_ANA_REG11_GPIOWK_POS (0)
#define SYS_ANA_REG11_GPIOWK_MASK (0xffffff)

#define SYS_ANA_REG11_RTCSEL_POS (24)
#define SYS_ANA_REG11_RTCSEL_MASK (0xf)

#define SYS_ANA_REG11_TIMERSEL_POS (28)
#define SYS_ANA_REG11_TIMERSEL_MASK (0xf)

