bekencorp/bk_idk/components/tinysoc/bk7236n/soc/sys_reg.h
#define SYS_ANA_REG12_ADDR (SOC_SYS_REG_BASE + (0x4c << 2))

#define SYS_ANA_REG12_TIMERSEL_POS (0)
#define SYS_ANA_REG12_TIMERSEL_MASK (0xffffffff)

#define SYS_ANA_REG13_ADDR (SOC_SYS_REG_BASE + (0x4d << 2))

#define SYS_ANA_REG13_RTCSEL_POS (0)
#define SYS_ANA_REG13_RTCSEL_MASK (0xffffffff)

#define SYS_ANA_REG14_ADDR (SOC_SYS_REG_BASE + (0x4e << 2))

#define SYS_ANA_REG14_ICTRL_DSPPLL_POS (0)
#define SYS_ANA_REG14_ICTRL_DSPPLL_MASK (0xf)

#define SYS_ANA_REG14_NC_4_18_POS (4)
#define SYS_ANA_REG14_NC_4_18_MASK (0x7fff)

#define SYS_ANA_REG14_MODE_POS (19)
#define SYS_ANA_REG14_MODE_MASK (0x1)

#define SYS_ANA_REG14_IDMSEL_POS (20)
#define SYS_ANA_REG14_IDMSEL_MASK (0x1)

#define SYS_ANA_REG14_HVREF_POS (21)
#define SYS_ANA_REG14_HVREF_MASK (0x3)

#define SYS_ANA_REG14_LVREF_POS (23)
#define SYS_ANA_REG14_LVREF_MASK (0x3)

#define SYS_ANA_REG14_NC_25_31_POS (25)
#define SYS_ANA_REG14_NC_25_31_MASK (0x7f)

#define SYS_ANA_REG15_ADDR (SOC_SYS_REG_BASE + (0x4f << 2))

#define SYS_ANA_REG15_CAMSEL_POS (0)
#define SYS_ANA_REG15_CAMSEL_MASK (0x1)

#define SYS_ANA_REG15_MSW_POS (1)
#define SYS_ANA_REG15_MSW_MASK (0x1ff)

#define SYS_ANA_REG15_TSTCKEN_PLL_POS (10)
#define SYS_ANA_REG15_TSTCKEN_PLL_MASK (0x1)

#define SYS_ANA_REG15_OSCCAL_TRIG_POS (11)
#define SYS_ANA_REG15_OSCCAL_TRIG_MASK (0x1)

#define SYS_ANA_REG15_CNTI_POS (12)
#define SYS_ANA_REG15_CNTI_MASK (0x1ff)

#define SYS_ANA_REG15_NC_21_21_POS (21)
#define SYS_ANA_REG15_NC_21_21_MASK (0x1)

#define SYS_ANA_REG15_SPI_RST_POS (22)
#define SYS_ANA_REG15_SPI_RST_MASK (0x1)

#define SYS_ANA_REG15_CLOSELOOPEN_POS (23)
#define SYS_ANA_REG15_CLOSELOOPEN_MASK (0x1)

#define SYS_ANA_REG15_CALTIME_POS (24)
#define SYS_ANA_REG15_CALTIME_MASK (0x1)

#define SYS_ANA_REG15_LPFRZ_POS (25)
#define SYS_ANA_REG15_LPFRZ_MASK (0x3)

#define SYS_ANA_REG15_ICP_POS (27)
#define SYS_ANA_REG15_ICP_MASK (0xf)

#define SYS_ANA_REG15_CP2CTRL_POS (31)
#define SYS_ANA_REG15_CP2CTRL_MASK (0x1)

#ifdef __cplusplus
}
#endif
